; domain
(define (domain harpia)

    (:requirements  :typing  :strips  :disjunctive-preconditions  :equality :fluents )

    (:types
        region - object
        base - region)


   
    (:functions
    

        ;; Variavel q controla bateria em porcentagem
        (battery_amount)
        ;; quantidade de insumo
        (input_amount)
        ;;velocidade de carregar a bateria em porcentagem por segundos
        (recharge_rate_battery)
        ;;velocidade de descarregar a bateria
        (discharge_rate_battery)
        ;;capacidade maxima bateria
        (battery_capacity)
        ;;capacidade maxima de insumo
        (input_capacity)
        ;;velocidade de reabastecer o insumo
        (recharge_rate_input)
        ;;distancia entre regioes em metros
        (distance ?from_region - region ?to_region - region)
        ;;velocidade em m/s
        (velocity)
        (picture_path_len ?region - region)
        (pulverize_path_len ?region - region)
        (total_goals)
        (goals_achived)
        (mission_length)

    )

     (:predicates
    
        (been_at ?region - region)
        ;;se esta carregando um insumo
        (carry)  
        ;;esta em uma regiao
        (at ?region - region)
        ;; se pode pulverizar
        (can_spray)
        ;;se pode carregar/descarregar
        (can_recharge)
        ;se já tirou a foto
        (taken_image ?region - region)
        ;se pulverizou
        (pulverized ?region - region)
        ; (canGo)
        (can_take_pic)
        (its_not_base ?region - region)
        (pulverize_goal ?region - region)
        (picture_goal ?region - region)
        (hw_ready ?from - region ?to - region)

        ; (can_go_to_base)
        ; (has_pulverize_goal)
        ; (has_picture_goal)
        ; (at_move)
    
    )


    (:action go_to
        :parameters (
             ?from_region - region 
             ?to_region - region)
        :precondition (and
            (at ?from_region)
            (> (battery_amount) (+ (* (/ (distance ?from_region ?to_region) (velocity)) (discharge_rate_battery)) 15))
        )
        :effect (and 
                (not (at ?from_region))
                (been_at ?to_region)
                (at ?to_region)
                (decrease (battery_amount ) 
                      (*
                          (/
                              (distance ?from_region ?to_region)
                              (velocity)
                          )
                          (discharge_rate_battery)
                      )
          
                )
                (increase (mission_length) (distance ?from_region ?to_region))
                )
    )
    
    (:action take_image
        :parameters (
            ?region - region
        )
        :precondition(and
            (at ?region)
            (picture_goal ?region)
            (> (battery_amount) 
                (*
                    (/
                        1000
                        (velocity)
                    )
                    (discharge_rate_battery)
                )
            )
       )
        :effect(and
            (taken_image ?region)
            (increase (mission_length) 1000)
            (decrease (battery_amount) 
                (*
                    (/
                        1000
                        (velocity)
                    )
                    (discharge_rate_battery)
                )
            )
        )
    )
    (:action pulverize_region
        :parameters (
            ?region - region)
        :precondition(and
            (at ?region)
            (pulverize_goal ?region)
            (> (input_amount) 0)
            (> (battery_amount) 
                (*
                    (/
                        314
                        (velocity)
                    )
                    (discharge_rate_battery)
                )
            )
       )
        :effect(and
            (pulverized ?region)
            (increase (mission_length) 314)
            (decrease (input_amount) 1)
            (decrease (battery_amount) 
                (*
                    (/
                        314
                        (velocity)
                    )
                    (discharge_rate_battery)
                )
            )
        )
    )
    (:action recharge_battery
        :parameters (?base - base)
        :precondition (and
            (at ?base)
            ;(< (battery_amount) 60)
        )
        :effect 
        (and
            (assign (battery_amount) (battery_capacity))
        )
    )

    (:action recharge_input
        :parameters (?base - base)
        :precondition (and
            (at ?base)
            (< (input_amount) (/ (input_capacity) 2))
        )
        :effect 
        (and
            (assign (input_amount) (input_capacity))
        )
    )
)

; problem
( define ( problem problem_1 )
( :domain harpia )
( :objects
	region_1 region_2 - region
	base_1 - base
)
( :init
	( picture_goal region_1 )
	( picture_goal region_2 )
	( at base_1 )
	( = ( distance base_1 base_1 ) 0.0000000000 )
	( = ( distance base_1 region_1 ) 126.2738489105 )
	( = ( distance base_1 region_2 ) 94.0538024899 )
	( = ( distance region_1 base_1 ) 126.2738489105 )
	( = ( distance region_1 region_1 ) 0.0000000000 )
	( = ( distance region_1 region_2 ) 129.3246029227 )
	( = ( distance region_2 base_1 ) 94.0538024899 )
	( = ( distance region_2 region_1 ) 129.3246029227 )
	( = ( distance region_2 region_2 ) 0.0000000000 )
	( = ( battery_capacity ) 100.0000000000 )
	( = ( discharge_rate_battery ) 0.1000000000 )
	( = ( velocity ) 7.0000000000 )
	( = ( input_capacity ) 1.0000000000 )
	( = ( battery_amount ) 100.0000000000 )
	( = ( input_amount ) 1.0000000000 )
	( = ( mission_length ) 0.0000000000 )
)
( :goal
	( and
		( taken_image region_1 )
		( taken_image region_2 )
		( at base_1 )
	))
)

; plan
1. (go_to base_1 region_1)
   deleted: (at base_1)
   added: (been_at region_1) (at region_1)
   changed: (battery_amount) from 100 to 98.1961, (mission_length) from 0 to 126.274
   goals met: 0 of 3
2. (take_image region_1)
   added: (taken_image region_1)
   changed: (mission_length) from 126.274 to 1126.27, (battery_amount) from 98.1961 to 83.9104
   goals met: 1 of 3
3. (go_to region_1 region_2)
   deleted: (at region_1)
   added: (been_at region_2) (at region_2)
   changed: (battery_amount) from 83.9104 to 82.0629, (mission_length) from 1126.27 to 1255.6
   goals met: 1 of 3
4. (take_image region_2)
   added: (taken_image region_2)
   changed: (mission_length) from 1255.6 to 2255.6, (battery_amount) from 82.0629 to 67.7772
   goals met: 2 of 3
5. (go_to region_2 base_1)
   deleted: (at region_2)
   added: (been_at base_1) (at base_1)
   changed: (battery_amount) from 67.7772 to 66.4335, (mission_length) from 2255.6 to 2349.65
   goals met: 3 of 3
